---
kind: method
id: M:Autodesk.Revit.UI.FilterDialog.Dispose
source: html/42d0e783-47c6-f4d2-81ab-a4ae9ead8bdc.htm
---
# Autodesk.Revit.UI.FilterDialog.Dispose Method

Releases all resources used by the FilterDialog

## Syntax (C#)
```csharp
public void Dispose()
```